Catalogs/КонтрактыИсполнителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>КонтрактыИсполнителей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.ГосударственныеКонтракты</xr:Item>
				<xr:Item>Catalog.КонтрактыСЗаказчиками</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияКонтрактов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрактСУчастникомГОЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосударственныйКонтракт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГосударственныеКонтракты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПлатежаФЗ275</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПлатежейФЗ275</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежиПо275ФЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОпределенияПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОпределенияПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКонтракта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспределениеОплатПоБанковскимСчетам</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РаспределениеЗаявокПоБанковскимСчетам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентОплатыЗаСчетСобственныхСредств</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВУтвержденномПеречнеИностранныхИсполнителейГОЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДобавленияПоследнегоДопСоглашения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПодтверждающиеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭтапыКонтрактов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХранилищеДополнительнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГосударственныйКонтракт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГосударственныеКонтракты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НомераКонтрактов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КонтрактСЗаказчиком</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтрактыСЗаказчиками</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/РаспределениеЗаявокПоБанковскимСчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>РаспределениеЗаявокПоБанковскимСчетам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоУказаннымКонтрактам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВсемКонтрактам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыЭтаповКонтрактов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ТипыЭтаповКонтрактов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аванс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/БанковскиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>БанковскиеСчета</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Comment>(Общ) Номер расчетного счета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкДляРасчетов</Name>
					<Comment>(Регл) Банк, в случае непрямых расчетов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстКорреспондента</Name>
					<Comment>(Регл) Текст "Плательщик\Получатель" в платежных документах</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстНазначения</Name>
					<Comment>(Общ) Текст назначения платежа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчета</Name>
					<Comment>(Общ) Расчетный, депозитный, ссудный, иной</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДенежныхСредств</Name>
					<Comment>(Общ) Валюта, в которой хранятся денежные средства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИДатаРазрешения</Name>
					<Comment>(Регл) Номер и дата разрешения открытия счета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Comment>(Общ) Дата открытия счета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Comment>(Общ) Дата закрытия счета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцПрописью</Name>
					<Comment>(Общ) Указывать в дате документа месяц прописью</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБезКопеек</Name>
					<Comment>(Общ) Указывать сумму без копеек, если она в целых рублях</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтдельныйСчетГОЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосударственныйКонтракт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГосударственныеКонтракты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЭтапыКонтрактов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ЭтапыКонтрактов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.КонтрактыИсполнителей</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктКонтрактаОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктКонтрактаПредмета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяКалькуляции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиКалькуляции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЭтапа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭтаповКонтрактов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифноеРегулирование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварыРаботыУслугиСТарифнымРегулированием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КонтрактыИсполнителей/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОбъектПодстановки") Тогда
		ЗначениеВРеквизитФормы(Параметры.ОбъектПодстановки, "Объект");
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
									ЭтапыИсполнения, "Владелец", Объект.Ссылка);
	
	КонтрактСУчастникомГОЗ = Объект.КонтрактСУчастникомГОЗ;
	Если Не КонтрактСУчастникомГОЗ Тогда
		Если Объект.ПлатежиПо275ФЗ Тогда
			КонтрактСУчастникомГОЗ = 2;
		Иначе
			КонтрактСУчастникомГОЗ = 0;
		КонецЕсли;
	КонецЕсли;
	
	УправлениеЭлементамиФормы();
	
	РассчитатьИтогПоЭтапам();
	
	Элементы.СтраницаКомментарий.Картинка = ОбщегоНазначенияКлиентСервер.КартинкаКомментария(Объект.Комментарий);
	
	УстановитьУсловноеОформление();
	
	ТекущийПользователь = Пользователи.АвторизованныйПользователь();
	
	КоличествоДопСоглашенийНаМоментОткрытия = КоличествоДопСоглашений();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РасставитьФлагиКонтракта(ТекущийОбъект);
	
	КоличествоДопСоглашений = КоличествоДопСоглашений();
	Если КоличествоДопСоглашенийНаМоментОткрытия < КоличествоДопСоглашений Тогда
		ТекущийОбъект.ДатаДобавленияПоследнегоДопСоглашения = ТекущаяУниверсальнаяДата();
		
		КоличествоДопСоглашенийНаМоментОткрытия = КоличествоДопСоглашений;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
									ЭтапыИсполнения, "Владелец", Объект.Ссылка);
	
	Элементы.СтраницаКомментарий.Картинка = ОбщегоНазначенияКлиентСервер.КартинкаКомментария(Объект.Комментарий);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыИсполненияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Объект.Ссылка.Пустая() Тогда
		Предупреждение(НСтр("ru = 'Сначала запишите элемент'"));
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрактСУчастникомГОЗПриИзменении(Элемент)
	
	КонтрактСУчастникомГОЗПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура КонтрактСУчастникомГОЗПриИзмененииНаСервере()
	
	РасставитьФлагиКонтракта(Объект);
	
	ПеречислениеМенеджер = Перечисления.РаспределениеЗаявокПоБанковскимСчетам;
	Если Объект.КонтрактСУчастникомГОЗ Тогда
		Если Объект.РаспределениеОплатПоБанковскимСчетам <> ПеречислениеМенеджер.ПоУказаннымКонтрактам Тогда
			Объект.РаспределениеОплатПоБанковскимСчетам = ПеречислениеМенеджер.ПоУказаннымКонтрактам;
			РаспределениеОплатПоБанковскимСчетамПриИзмененииНаСервере();
		КонецЕсли;
	Иначе
		Если Объект.РаспределениеОплатПоБанковскимСчетам <> ПеречислениеМенеджер.ПоВсемКонтрактам Тогда
			Объект.РаспределениеОплатПоБанковскимСчетам = ПеречислениеМенеджер.ПоВсемКонтрактам;
			РаспределениеОплатПоБанковскимСчетамПриИзмененииНаСервере();
		КонецЕсли;
	КонецЕсли;
	
	Если Не Объект.КонтрактСУчастникомГОЗ Тогда
		Объект.ГосударственныйКонтракт = Неопределено;
	КонецЕсли;
	
	// Для разных типов контрактов, разные допустимые значения типа платежа
	Объект.ТипПлатежаФЗ275 = Неопределено;

	ЗаполнитьБанковскийСчет();
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждающиеДокументыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Элемент.ТекущиеДанные.Файл = ВыбранноеЗначение;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	Элементы.ГруппаГосударственныйКонтракт.Видимость = Объект.КонтрактСУчастникомГОЗ;
	Элементы.ПодтверждающиеДокументыГосударственныйКонтракт.Видимость = Не Объект.КонтрактСУчастникомГОЗ И Объект.ПлатежиПо275ФЗ;
	Элементы.СтраницаНомераГК.Видимость = КонтрактСУчастникомГОЗ;
	
	Элементы.ГруппаСведенияДляПлатежей.Видимость = КонтрактСУчастникомГОЗ;
	Элементы.ПодтверждающиеДокументы.Видимость = КонтрактСУчастникомГОЗ;
	
	Элементы.ПроцентОплатыЗаСчетСобственныхСредств.Доступность = КонтрактСУчастникомГОЗ = 2;
	Элементы.РаспределениеОплатПоБанковскимСчетам.Доступность = Не Объект.КонтрактСУчастникомГОЗ;
	Элементы.НомераКонтрактов.Доступность = Объект.РаспределениеОплатПоБанковскимСчетам = Перечисления.РаспределениеЗаявокПоБанковскимСчетам.ПоУказаннымКонтрактам;
	
	ПараметрыВыбораКонтрактов = Новый Массив;
	ПараметрОрганизация = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Организация");
	ПараметрыВыбораКонтрактов.Добавить(ПараметрОрганизация);
	Если Объект.КонтрактСУчастникомГОЗ Тогда
		ПараметрГосКонтракт = Новый СвязьПараметраВыбора("Отбор.ГосударственныйКонтракт", "Объект.ГосударственныйКонтракт");
		ПараметрыВыбораКонтрактов.Добавить(ПараметрГосКонтракт);
	КонецЕсли;
	
	Элементы.НомераГККонтрактСЗаказчиком.СвязиПараметровВыбора = Новый ФиксированныйМассив(ПараметрыВыбораКонтрактов);
	
	ОбщегоНазначения275Сервер.УстановитьПараметрыВыбораТипаПлатежа275ФЗ(Элементы.ТипПлатежаФЗ275, Объект);
	
	ИностранныйИсполнитель = Объект.Владелец.НеЯвляетсяРезидентом;
	Элементы.ЕстьВУтвержденномПеречнеИностранныхИсполнителейГОЗ.Видимость = ИностранныйИсполнитель;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗаписанКонтрактИсполнителя", ВладелецФормы);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьБанковскийСчет()
	
	Если Не КонтрактСУчастникомГОЗ Тогда
		Объект.БанковскийСчетКонтрагента = Объект.Владелец.ОсновнойБанковскийСчет;
	Иначе
		Объект.БанковскийСчетКонтрагента = Справочники.БанковскиеСчета.ПолучитьБанковскийСчетГосКонтрактаПоУмолчанию(
			Объект.Владелец, Объект.ГосударственныйКонтракт);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	ВладелецПриИзмененииСервер();
КонецПроцедуры

&НаСервере 
Процедура ВладелецПриИзмененииСервер()
	
	ЗаполнитьБанковскийСчет();
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ГосударственныйКонтрактПриИзменении(Элемент)
	
	ГосударственныйКонтрактПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
Процедура ГосударственныйКонтрактПриИзмененииСервер()
	ЗаполнитьБанковскийСчет();
	
	ЗаполнитьГосударственныйКонтрактПодтверждающихДокументов();
	
	Объект.СпособОпределенияПоставщика = Объект.ГосударственныйКонтракт.СпособОпределенияПоставщика;
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьГосударственныйКонтрактПодтверждающихДокументов()
	Для Каждого СтрокаПодтверждающихДокументов Из Объект.ПодтверждающиеДокументы Цикл
		Если Объект.ГосударственныйКонтракт <> СтрокаПодтверждающихДокументов.ГосударственныйКонтракт Тогда
			СтрокаПодтверждающихДокументов.ГосударственныйКонтракт = Объект.ГосударственныйКонтракт;
			СтрокаПодтверждающихДокументов.Файл = Неопределено;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПодтверждающиеДокументы(Команда)
	
	ЗаполнитьПодтверждающиеДокументыСервер();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодтверждающиеДокументыСервер()
	
	Справочники.КонтрактыИсполнителей.ЗаполнитьПодтверждающиеДокументы(Объект);
	
КонецПроцедуры

&НаСервере
Процедура РасставитьФлагиКонтракта(ОбъектРасстановки)
	
	Если КонтрактСУчастникомГОЗ = 1 Тогда
		ОбъектРасстановки.КонтрактСУчастникомГОЗ = Истина;
		ОбъектРасстановки.ПлатежиПо275ФЗ = Истина;
	ИначеЕсли КонтрактСУчастникомГОЗ = 2 Тогда
		ОбъектРасстановки.КонтрактСУчастникомГОЗ = Ложь;
		ОбъектРасстановки.ПлатежиПо275ФЗ = Истина;
	Иначе
		ОбъектРасстановки.КонтрактСУчастникомГОЗ = Ложь;
		ОбъектРасстановки.ПлатежиПо275ФЗ = Ложь;
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщегоНазначения275КлиентСервер.ПроверитьИспользованиеПодсистемы(Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ДоговорОбработкаВыбораНаСервере(ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ДоговорОбработкаВыбораНаСервере(ВыбранноеЗначение, СтандартнаяОбработка)
	Отказ = Ложь;
	ВидДоговораСПоставщиком = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком");
	ОбщегоНазначения275КлиентСервер.ПроверитьДоговор(Объект.Ссылка, ВыбранноеЗначение, ВидДоговораСПоставщиком, "исполнителем", Отказ);
	СтандартнаяОбработка = Не Отказ;
	
	ОбъектБД = ДанныеФормыВЗначение(Объект, Тип("СправочникОбъект.КонтрактыИсполнителей"));
	Если Не Отказ И ОбъектБД.ЭтоНовый() Тогда
		ОбъектБД.Заполнить(ВыбранноеЗначение);
		ЗначениеВДанныеФормы(ОбъектБД, Объект);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура РассчитатьИтогПоЭтапам()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЭтапыКонтрактов.СуммаОплаты) КАК СуммаОплаты
		|ИЗ
		|	Справочник.ЭтапыКонтрактов КАК ЭтапыКонтрактов
		|ГДЕ
		|	ЭтапыКонтрактов.Владелец = &Владелец
		|	И НЕ ЭтапыКонтрактов.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ИтогоПоЭтапам = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ИтогоПоЭтапам = ВыборкаДетальныеЗаписи.СуммаОплаты;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	ВидыПодтверждающиеИсполнениеКонтракта = Новый СписокЗначений;
	ВидыПодтверждающиеИсполнениеКонтракта.ЗагрузитьЗначения(Справочники.ВидыДокументов.ВидыПодтверждающиеИсполнениеКонтракта());

	// Текст незаполненного этапа - "<Для всех платежей>"

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПодтверждающиеДокументыЭтап.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ПодтверждающиеДокументы.Этап");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru= '<Для всех платежей>'"));

	// Текст незаполненного файла - "<Указывается в заявке>"

	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПодтверждающиеДокументыФайл.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ПодтверждающиеДокументы.Файл");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru= '<Указывается в заявке>'"));
	
	// Текст незаполненного номера - "<Указывается в заявке>"

	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПодтверждающиеДокументыНомер.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ПодтверждающиеДокументы.Номер");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru= '<Указывается в заявке>'"));
	
	// Текст незаполненного номера - "<Указывается в заявке>"

	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПодтверждающиеДокументыДата.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ПодтверждающиеДокументы.Дата");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru= '<Указывается в заявке>'"));
	
	// Блокировка выбора подтверждающего документа, если не указан гос. контракт
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПодтверждающиеДокументыФайл.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ПодтверждающиеДокументы.ГосударственныйКонтракт");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Gray);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru= '<Укажите гос. контракт>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаСервере 
Функция КоличествоДопСоглашений()
	Отбор = Новый Структура("ВидДокумента", Справочники.ВидыДокументов.ДополнительноеСоглашение);
	НайденныеСтроки = Объект.ПодтверждающиеДокументы.НайтиСтроки(Отбор);
	
	Возврат НайденныеСтроки.Количество();
КонецФункции

&НаКлиенте
Процедура НомераКонтрактовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Объект.НомераКонтрактов.Количество() = 1 Тогда
		Объект.НомераКонтрактов[0].Процент = 100;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждающиеДокументыВидДокументаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ПодтверждающиеДокументы.ТекущиеДанные;
	
	Если ТекущиеДанные.ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументов.Контракт") Тогда
		ТекущиеДанные.Номер = Объект.Номер;
		ТекущиеДанные.Дата = Объект.Дата;
		ТекущиеДанные.Сумма = Объект.СуммаКонтракта;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждающиеДокументыПриИзменении(Элемент)
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено И Объект.КонтрактСУчастникомГОЗ Тогда
		ТекущиеДанные.ГосударственныйКонтракт = Объект.ГосударственныйКонтракт;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждающиеДокументыЭтапПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ПодтверждающиеДокументы.ТекущиеДанные;
	ТекущиеДанныеСтруктура = Новый Структура("Этап, Дата, Сумма", ТекущиеДанные.Этап, ТекущиеДанные.Дата, ТекущиеДанные.Сумма);
	
	ПодтверждающиеДокументыЭтапПриИзмененииНаСервере(ТекущиеДанныеСтруктура);
	
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ТекущиеДанныеСтруктура);
КонецПроцедуры

&НаСервере
Процедура ПодтверждающиеДокументыЭтапПриИзмененииНаСервере(ТекущиеДанные)
	РеквизитыЭтапа = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущиеДанные.Этап, "Дата, СуммаОплаты");
	
	ТекущиеДанные.Дата = РеквизитыЭтапа.Дата;
	ТекущиеДанные.Сумма = РеквизитыЭтапа.СуммаОплаты;
КонецПроцедуры

&НаСервере
Процедура ПроверитьДобавитьВидыДокументов(НовыйОбъект)
	
	МассивДобавляемыхФайлов = Новый Массив;
	
	ТипЭтапа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НовыйОбъект, "ТипЭтапа");
	Если ТипЭтапа = Перечисления.ТипыЭтаповКонтрактов.Аванс Тогда
		МассивДобавляемыхФайлов.Добавить(Справочники.ВидыДокументов.Счет);
	ИначеЕсли ТипЭтапа = Перечисления.ТипыЭтаповКонтрактов.Оплата Тогда
		МассивДобавляемыхФайлов.Добавить(Справочники.ВидыДокументов.ТранспортнаяНакладная);
		МассивДобавляемыхФайлов.Добавить(Справочники.ВидыДокументов.СчетФактура);
	КонецЕсли;
	
	Для Каждого Элемент из МассивДобавляемыхФайлов Цикл
		СтруктураПоиска = Новый Структура("Этап, ВидДокумента", НовыйОбъект, Элемент);
		Если Объект.ПодтверждающиеДокументы.НайтиСтроки(СтруктураПоиска).Количество() Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Объект.ПодтверждающиеДокументы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураПоиска);
		Если Объект.КонтрактСУчастникомГОЗ Тогда
			НоваяСтрока.ГосударственныйКонтракт = Объект.ГосударственныйКонтракт;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеОплатПоБанковскимСчетамПриИзменении(Элемент)
	
	РаспределениеОплатПоБанковскимСчетамПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура РаспределениеОплатПоБанковскимСчетамПриИзмененииНаСервере()
	
	Если Объект.РаспределениеОплатПоБанковскимСчетам =
		Перечисления.РаспределениеЗаявокПоБанковскимСчетам.ПоВсемКонтрактам Тогда
		
		Объект.НомераКонтрактов.Очистить();
		
	Иначе
		
		Если Объект.КонтрактСУчастникомГОЗ Тогда
			
			Объект.ПроцентОплатыЗаСчетСобственныхСредств = 0;
			
		КонецЕсли;
		
	КонецЕсли;
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыИсполненияОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	ПроверитьДобавитьВидыДокументов(НовыйОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьБанковскийСчет(Команда)
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.Владелец) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не указан исполнитель'"), , , , Отказ);
	КонецЕсли;
	
	Если Объект.КонтрактСУчастникомГОЗ И 
		Не ЗначениеЗаполнено(Объект.ГосударственныйКонтракт) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не указан государственный контракт'"), , , , Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСоздания = Новый Структура;
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Владелец", Объект.Владелец);
	Если Объект.КонтрактСУчастникомГОЗ Тогда
		ПараметрыЗаполнения.Вставить("ГосударственныйКонтракт", Объект.ГосударственныйКонтракт);
		ПараметрыЗаполнения.Вставить("ОтдельныйСчетГОЗ", Истина);
	КонецЕсли;
	ПараметрыСоздания.Вставить("ЗначенияЗаполнения", ПараметрыЗаполнения);
	
	ОткрытьФорму("Справочник.БанковскиеСчета.Форма.ФормаЭлемента", 
			ПараметрыСоздания, Элементы.БанковскийСчетКонтрагента);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПаспортКонтракта(Команда)
	ПФ = Новый Структура("Ссылка", Объект.Ссылка);
	ОткрытьФорму("Отчет.ПаспортКонтракта.Форма.Форма", ПФ, ЭтаФорма);
КонецПроцедуры
